Repository: srevinsaju/mateton-activity
Catalog: po/*.po
Languages: am

source: Tools
am: ቁሳቁስ

source: Erase
am: ፋቅ

source: History
am: ታሪክ

source: Undo
am: ሻር

source: Zoom
am: አጉላ

source: Start new operation
am: አዲስ ግብረት ጀምር

source: Addition
am: ድምር

source: Subtraction
am: ቅነሳ

source: Multiplication
am: ማባዛት

source: Division
am: ክፍፍል
